---
kind: method
id: M:Autodesk.Revit.DB.GeometryElement.GetEnumerator
source: html/0fc43a48-e1e6-874b-f9f8-844b9581d13f.htm
---
# Autodesk.Revit.DB.GeometryElement.GetEnumerator Method

Returns an enumerator that iterates through the collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<GeometryObject> GetEnumerator()
```

## Returns
An IEnumerator(GeometryObject) object that can be used to iterate through the collection.